scottywei/tinyuf2/ports/stm32f1/stm32f1xx_hal_conf.h
#ifndef STM32F1XX_HAL_CONF_H_
#define STM32F1XX_HAL_CONF_H_

#define HAL_MODULE_ENABLED
#define HAL_RCC_MODULE_ENABLED
#define HAL_GPIO_MODULE_ENABLED
#define HAL_CORTEX_MODULE_ENABLED
#define HAL_FLASH_MODULE_ENABLED
#define HAL_PWR_MODULE_ENABLED

#ifndef HSE_VALUE
#define HSE_VALUE                 16000000U
#endif
#define HSE_STARTUP_TIMEOUT       100U
#define HSI_VALUE                 8000000U
#define LSI_VALUE                 40000U
#define LSE_VALUE                 32768U
#define LSE_STARTUP_TIMEOUT       5000U

#define VDD_VALUE                 3300U
#define TICK_INT_PRIORITY         0U
#define USE_RTOS                  0U
#define PREFETCH_ENABLE           1U

#include "stm32f1xx_hal_rcc.h"
#include "stm32f1xx_hal_gpio.h"
#include "stm32f1xx_hal_cortex.h"
#include "stm32f1xx_hal_flash.h"
#include "stm32f1xx_hal_pwr.h"

#define assert_param(expr) ((void)0U)

#endif
